// Задача 52. Задайте двумерный массив из целых чисел. 
// Найдите среднее арифметическое элементов в каждом столбце.


Console.Write("Введите количество строк");

Console.Write("Введите количество столбцов");